from django.contrib.auth.models import AbstractUser
from django.db import models

FACULTY_CHOICES = [
    ('เกษตร', 'เกษตร'),
    ('บริหารธุรกิจ', 'บริหารธุรกิจ'),
    ('ประมง', 'ประมง'),
    ('มนุษยศาสตร์', 'มนุษยศาสตร์'),
    ('วนศาสตร์', 'วนศาสตร์'),
    ('วิทยาศาสตร์', 'วิทยาศาสตร์'),
    ('วิศวกรรมศาสตร์', 'วิศวกรรมศาสตร์'),
    ('ศึกษาศาสตร์', 'ศึกษาศาสตร์'),
    ('เศรษฐศาสตร์', 'เศรษฐศาสตร์'),
    ('สถาปัตยกรรมศาสตร์', 'สถาปัตยกรรมศาสตร์'),
    ('สังคมศาสตร์', 'สังคมศาสตร์'),
    ('สัตวแพทยศาสตร์', 'สัตวแพทยศาสตร์'),
    ('อุตสาหกรรมเกษตร', 'อุตสาหกรรมเกษตร'),
    ('เทคนิคการสัตวแพทย์', 'เทคนิคการสัตวแพทย์'),
    ('สิ่งแวดล้อม', 'สิ่งแวดล้อม'),
    ('แพทยศาสตร์', 'แพทยศาสตร์'),
    ('พยาบาลศาสตร์', 'พยาบาลศาสตร์'),
    ('สหวิทยาการจัดการและเทคโนโลยี', 'สหวิทยาการจัดการและเทคโนโลยี'),
    ('วิทยาลัยบูรณาการศาสตร์', 'วิทยาลัยบูรณาการศาสตร์'),
    ('บัณฑิตวิทยาลัย', 'บัณฑิตวิทยาลัย'),
    ('โครงการจัดตั้งวิทยาลัยนานาชาติ', 'โครงการจัดตั้งวิทยาลัยนานาชาติ')
]

DEPARTMENT_CHOICES = [
    # เกษตร
    ('กีฏวิทยา', 'กีฏวิทยา'),
    ('เกษตรกลวิธาน', 'เกษตรกลวิธาน'),
    ('คหกรรมศาสตร์', 'คหกรรมศาสตร์'),
    ('ปฐพีวิทยา', 'ปฐพีวิทยา'),
    ('พืชไร่นา', 'พืชไร่นา'),
    ('พืชสวน', 'พืชสวน'),
    ('โรคพืช', 'โรคพืช'),
    ('ส่งเสริมและนิเทศศาสตร์เกษตร', 'ส่งเสริมและนิเทศศาสตร์เกษตร'),
    ('สัตวบาล', 'สัตวบาล'),
    # บริหาร
    ('การเงิน', 'การเงิน'),
    ('การจัดการ', 'การจัดการ'),
    ('การจัดการเทคโนโลยีและการปฏิบัติการ', 'การจัดการเทคโนโลยีและการปฏิบัติการ'),
    ('การตลาด', 'การตลาด'),
    ('บัญชี', 'บัญชี'),
    # ประมง
    ('การจัดการประมง', 'การจัดการประมง'),
    ('ชีววิทยาประมง', 'ชีววิทยาประมง'),
    ('ผลิตภัณฑ์ประมง', 'ผลิตภัณฑ์ประมง'),
    ('เพาะเลี้ยงสัตว์น้ำ', 'เพาะเลี้ยงสัตว์น้ำ'),
    ('วิทยาศาสตร์ทางทะเล', 'วิทยาศาสตร์ทางทะเล'),
    # มนุษยศาสตร์
    ('ดนตรี', 'ดนตรี'),
    ('นิเทศศาสตร์และสารสนเทศศาสตร์', 'นิเทศศาสตร์และสารสนเทศศาสตร์'),
    ('ภาษาต่างประเทศ', 'ภาษาต่างประเทศ'),
    ('วรรณคดี', 'วรรณคดี'),
    ('ภาษาศาสตร์', 'ภาษาศาสตร์'),
    ('ภาษาไทย', 'ภาษาไทย'),
    ('ภาษาตะวันออก', 'ภาษาตะวันออก'),
    ('ปรัชญาและศาสนา', 'ปรัชญาและศาสนา'),
    ('อุตสาหกรรมท่องเที่ยวและบริการ', 'อุตสาหกรรมท่องเที่ยวและบริการ'),
    # วนศาสตร์
    ('การจัดการป่าไม้', 'การจัดการป่าไม้'),
    ('ชีววิทยาป่าไม้', 'ชีววิทยาป่าไม้'),
    ('วิศวกรรมป่าไม้', 'วิศวกรรมป่าไม้'),
    ('วนผลิตภัณฑ์', 'วนผลิตภัณฑ์'),
    ('วนวัฒนวิทยา', 'วนวัฒนวิทยา'),
    ('อนุรักษวิทยา', 'อนุรักษวิทยา'),
    # วิทยาศาสตร์
    ('คณิตศาสตร์', 'คณิตศาสตร์'),
    ('เคมี', 'เคมี'),
    ('จุลชีววิทยา', 'จุลชีววิทยา'),
    ('ชีวเคมี', 'ชีวเคมี'),
    ('พฤกษศาสตร์', 'พฤกษศาสตร์'),
    ('พันธุศาสตร์', 'พันธุศาสตร์'),
    ('ฟิสิกส์', 'ฟิสิกส์'),
    ('รังสีประยุกต์และไอโซโทป', 'รังสีประยุกต์และไอโซโทป'),
    ('วิทยาการคอมพิวเตอร์', 'วิทยาการคอมพิวเตอร์'),
    ('วิทยาศาสตร์พื้นพิภพ', 'วิทยาศาสตร์พื้นพิภพ'),
    ('วัสดุศาสตร์', 'วัสดุศาสตร์'),
    ('สถิติ', 'สถิติ'),
    ('สัตววิทยา', 'สัตววิทยา'),
    # วิศวกรรมศาสตร์
    ('วิศวกรรมการบินและอวกาศ', 'วิศวกรรมการบินและอวกาศ'),
    ('วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมคอมพิวเตอร์'),
    ('วิศวกรรมเคมี', 'วิศวกรรมเคมี'),
    ('วิศวกรรมเครื่องกล', 'วิศวกรรมเครื่องกล'),
    ('วิศวกรรมทรัพยากรน้ำ', 'วิศวกรรมทรัพยากรน้ำ'),
    ('วิศวกรรมไฟฟ้า', 'วิศวกรรมไฟฟ้า'),
    ('วิศวกรรมวัสดุ', 'วิศวกรรมวัสดุ'),
    ('วิศวกรรมโยธา', 'วิศวกรรมโยธา'),
    ('วิศวกรรมสิ่งแวดล้อม', 'วิศวกรรมสิ่งแวดล้อม'),
    ('วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ'),
    # ศึกษาศาสตร์
    ('การศึกษา', 'การศึกษา'),
    ('จิตวิทยาการศึกษาและการแนะแนว', 'จิตวิทยาการศึกษาและการแนะแนว'),
    ('เทคโนโลยีการศึกษา', 'เทคโนโลยีการศึกษา'),
    ('พลศึกษา', 'พลศึกษา'),
    ('อาชีวศึกษา', 'อาชีวศึกษา'),
    # เศรษฐศาสตร์
    ('เศรษฐศาสตร์', 'เศรษฐศาสตร์'),
    ('เศรษฐศาสตร์เกษตรและทรัพยากร', 'เศรษฐศาสตร์เกษตรและทรัพยากร'),
    ('สหกรณ์', 'สหกรณ์'),
    # สถาปัตยกรรม
    ('สถาปัตยกรรม', 'สถาปัตยกรรม'),
    ('ภูมิสถาปัตยกรรม', 'ภูมิสถาปัตยกรรม'),
    ('นวัตกรรมอาคาร', 'นวัตกรรมอาคาร'),
    # สังคมศาสตร์
    ('จิตวิทยา', 'จิตวิทยา'),
    ('นิติศาสตร์', 'นิติศาสตร์'),
    ('ประวัติศาสตร์', 'ประวัติศาสตร์'),
    ('ภูมิศาสตร์', 'ภูมิศาสตร์'),
    ('รัฐศาสตร์และรัฐประศาสนศาษตร์', 'รัฐศาสตร์และรัฐประศาสนศาษตร์'),
    ('สังคมวิทยาและมานุษยวิทยา', 'สังคมวิทยาและมานุษยวิทยา'),
    ('โครงการสหวิทยาการระดับบัณฑิตศึกษา สาขาพัฒนาสังคม', 'โครงการสหวิทยาการระดับบัณฑิตศึกษา สาขาพัฒนาสังคม'),
    ('โครงการเอเชียตะวันออกเฉียงใต้ภาคพิเศษ', 'โครงการเอเชียตะวันออกเฉียงใต้ภาคพิเศษ'),
    # สัตวแพทยศาสตร์
    ('กายวิภาคศาสตร์', 'กายวิภาคศาสตร์'),
    ('สรีรวิทยา', 'สรีรวิทยา'),
    ('จุลชีววิทยาและวิทยาภูมิคุ้มกัน', 'จุลชีววิทยาและวิทยาภูมิคุ้มกัน'),
    ('เภสัชวิทยา', 'เภสัชวิทยา'),
    ('พยาธิวิทยา', 'พยาธิวิทยา'),
    ('ปรสิตวิทยา', 'ปรสิตวิทยา'),
    # อุตสาหกรรมเกษตร
    ('เทคโนโลยีอุตสาหกรรมเกษตร', 'เทคโนโลยีอุตสาหกรรมเกษตร'),
    ('เทคโนโลยีชีวภาพ', 'เทคโนโลยีชีวภาพ'),
    ('วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร'),
    ('เทคโนโลยีการบรรจุ และวัสดุ', 'เทคโนโลยีการบรรจุ และวัสดุ'),
    ('พัฒนาผลิตภัณฑ์', 'พัฒนาผลิตภัณฑ์'),
    ('วิทยาการสิ่งทอ', 'วิทยาการสิ่งทอ'),
    ('นวัตกรรมและเทคโนโลยีอุตสาหกรรมเกษตร (หลักสูตรนานาชาติ)', 'นวัตกรรมและเทคโนโลยีอุตสาหกรรมเกษตร (หลักสูตรนานาชาติ)'),
    # เทคนิคการสัตวแพทย์
    ('เทคนิคการสัตวแพทย์', 'เทคนิคการสัตวแพทย์'),
    ('สาขาวิชาการพยาบาลสัตว์ (ภาคพิเศษ)', 'สาขาวิชาการพยาบาลสัตว์ (ภาคพิเศษ)'),
    ('สาขาวิชาเทคนิคการสัตวแพทย์ (ภาคพิเศษ)', 'สาขาวิชาเทคนิคการสัตวแพทย์ (ภาคพิเศษ)'),
    # สิ่งแวดล้อม
    ('เทคโนโลยีและการจัดการสิ่งแวดล้อม', 'เทคโนโลยีและการจัดการสิ่งแวดล้อม'),
    ('วิทยาศาสตร์สิ่งแวดล้อม', 'วิทยาศาสตร์สิ่งแวดล้อม'),
    # แพทยศาสตร์
    ('แพทยศาสตร์', 'แพทยศาสตร์'),
    # พยาบาลศาสตร์
    ('พยาบาลศาสตร์', 'พยาบาลศาสตร์'),
    # สหวิทยาการจัดการและเทคโนโลยี
    ('การจัดการท่องเที่ยวเชิงวัฒนธรรมและสุขภาพ', 'การจัดการท่องเที่ยวเชิงวัฒนธรรมและสุขภาพ'),
    ('การจัดการอุตสาหกรรมการบริการ', 'การจัดการอุตสาหกรรมการบริการ'),
]

EDUCATION_LEVEL_CHOICES = [
    ('ปริญญาตรี', 'ปริญญาตรี'),
    ('ปริญญาโท', 'ปริญญาโท'),
    ('ปริญญาเอก', 'ปริญญาเอก')
]

STATUS_CHOICES = [
    ('ผู้กู้ยืมรายใหม่', 'ผู้กู้ยืมรายใหม่'),
    ('ผู้กู้ยืมรายเก่า', 'ผู้กู้ยืมรายเก่า')
]

# Create your models here.
class Education(models.Model):
    student_id_number = models.CharField(max_length=10, unique=True)
    faculty = models.CharField(max_length=150, choices=FACULTY_CHOICES)
    department = models.CharField(max_length=150, choices=DEPARTMENT_CHOICES)
    education_level = models.CharField(max_length=150, choices=EDUCATION_LEVEL_CHOICES)
    status = models.CharField(max_length=150, choices=STATUS_CHOICES, default='ผู้กู้ยืมรายใหม่')
    
    
class User(AbstractUser):
    email = models.EmailField(unique=True)
    name = models.CharField(max_length=150)
    date_of_birth = models.DateField()
    tel_number = models.CharField(max_length=20, unique=True)
    identity_card_number = models.CharField(max_length=13, unique=True)
    image = models.ImageField(upload_to='profile/')
    education = models.OneToOneField(Education, null=True, on_delete=models.CASCADE, blank=True, db_column='education')
    last_login = None
    first_name = None
    last_name = None
    date_joined = None
    
    